# 5. 계층적 색인

#### 계층적 색인 : 축에 대해 다중 색인 단계를 지정할 수 있게 해준다.

In [1]:
from pandas import Series, DataFrame

import pandas as pd
import numpy as np

In [2]:
data = Series(np.random.randn(10), index=[['a','a','a','b','b','b','c','c','d','d'],
                                         [1,2,3,1,2,3,1,2,2,3]])

In [3]:
data

a  1    0.519889
   2    0.686310
   3    0.029734
b  1   -1.079805
   2   -0.430996
   3   -0.806021
c  1    1.292040
   2   -0.217017
d  2   -1.010527
   3    0.609360
dtype: float64

In [4]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [5]:
data['b']

1   -1.079805
2   -0.430996
3   -0.806021
dtype: float64

In [6]:
data['b':'c']

b  1   -1.079805
   2   -0.430996
   3   -0.806021
c  1    1.292040
   2   -0.217017
dtype: float64

In [12]:
data.loc[['b','d']]

b  1   -1.079805
   2   -0.430996
   3   -0.806021
d  2   -1.010527
   3    0.609360
dtype: float64

In [13]:
data.loc['b':'d']

b  1   -1.079805
   2   -0.430996
   3   -0.806021
c  1    1.292040
   2   -0.217017
d  2   -1.010527
   3    0.609360
dtype: float64

In [15]:
# 하위 계층 색인
data[:,2]

a    0.686310
b   -0.430996
c   -0.217017
d   -1.010527
dtype: float64

In [16]:
# 계층적 색인 -> 데이터를 재생성하고 피벗 테이블 생성 같은 그룹기반의 작업을 할때 중요
data.unstack()

          1         2         3
a  0.519889  0.686310  0.029734
b -1.079805 -0.430996 -0.806021
c  1.292040 -0.217017       NaN
d       NaN -1.010527  0.609360

In [17]:
data.unstack().stack()

a  1    0.519889
   2    0.686310
   3    0.029734
b  1   -1.079805
   2   -0.430996
   3   -0.806021
c  1    1.292040
   2   -0.217017
d  2   -1.010527
   3    0.609360
dtype: float64

In [18]:
df = DataFrame(np.arange(12).reshape(4,3),
              index = [['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
              columns = [['Ohio', 'Ohio', 'Colorado'],
                        ['Green', 'Red', 'Green']])

In [19]:
df

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [20]:
# 색인의 이름과 축의 라벨을 혼동하지 말자

df.index.names = ['key1', 'key2']
df.columns.names = ['state', 'color']
df

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [21]:
df['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

## 5.1 계층 순서 바꾸고 정렬하기

In [22]:
df.swaplevel('key1', 'key2')
# = df.swaplevel(0,1)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [24]:
df.sortlevel(1)

/Users/nosangho/anaconda/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: sortlevel is deprecated, use sort_index(level= ...)
  """Entry point for launching an IPython kernel.

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [27]:
df.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [31]:
df.swaplevel(0,1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

## 5.2 단계별 통계요약

In [32]:
df.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [36]:
df.sum(level='color', axis=1) # column의 level이기 때문에 axis option 필요

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

## 5.3 DataFrame의 칼럼 사용하기

In [38]:
data = {'a': range(7),
       'b': range(7, 0,-1),
       'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
       'd': [0,1,2,0,1,2,3]}
df = DataFrame(data)
df

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [40]:
df2 = df.set_index(['c','d'])
df2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [41]:
df.set_index(['c','d'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [42]:
df2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1